#### MetallicpaintPearlType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MetallicpaintPearl" from the "MetallicPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MetallicpaintPearlType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MetallicpaintPearlType ``` |

| Visual C++ |
| --- |
| ``` public enum class MetallicpaintPearlType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Chromatic |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace